-- Домашна работа по Функционално програмиране
-- Никол Георгиева - група 4 
main :: IO()
main = do
    print $ minimalSplit [1,2,3,4,2,3,2,1]

-- Задача 2. Да се дефинира функция, която получава списък lst от тип, за който е дефиниран оператор за равенство, 
-- и връща списък от списъци, всеки от елементите на който съдържа различни елементи от подадения 
-- lst(всеки елемент от lst се съдържа в точно един от елементите на резултатния списък). 
-- Резултатният списък трябва да е с възможно най-малко елементи, като подредбата на елементите е произволна.
-- minimalSplit [1,2,3,4,2,3,2,1] -- Примерен изход: [[1,2,3,4],[2,3,1],[2]]
                                                
minimalSplit :: Eq a => [a] -> [[a]]
minimalSplit = foldl insertElem []
  where
    insertElem [] x = [[x]]
    insertElem (s:ss) x
      | x `elem` s = s : insertElem ss x
      | otherwise  = (s ++ [x]) : ss

-- Обяснение:
-- Функцията обхожда елементите един по един и добавя текущия елемент в първия списък, в който той не присъства