-- Домашна работа по Функционално програмиране
-- Никол Георгиева - група 4 
main :: IO()
main = do
        print $ take 5 pascalTriangle

-- Задача 3. Да се състави безкраен списък, елементите на който представляват съответните редове на известния триъгълник на Паскал.  
-- pascalTriangle :: [[Integer]]
-- pascalTriangle = -- подходяща дефиниция
-- take 5 pascalTriangle -- Примерен изход: [[1],[1,1],[1,2,1],[1,3,3,1],[1,4,6,4,1]]

pascalTriangle :: [[Integer]]
pascalTriangle = [first, second] ++ buildRows second
  where
    first = [1]
    second = [1, 1]
    buildRows prev = 
      let next = zipWith (+) ([0] ++ prev) (prev ++ [0])
      in next : buildRows next

-- Обяснение: 
-- Започваме с първите два реда [1] и [1,1]. Следващите редове се получават като събираме съседни елементи от предишния ред, 
-- като към началото и края му добавяме 0. По този начин изграждаме всеки следващ ред от предишния.
-- Пример: 
-- Ако prev = [1, 2, 1]
-- Добавяме 0 в началото и края:
-- [0] ++ prev = [0, 1, 2, 1]
-- prev ++ [0] = [1, 2, 1, 0]
-- Събираме ги с zipWith (+):
-- zipWith (+) [0,1,2,1] [1,2,1,0] = [1,3,3,1]